def area(a, b): 
    '''
    Принимает стороны прямоугольника и возвращает площадь
        Параметры:
            a (int/float): первая сторона прямоугольника
            b (int/float): вторая сторона прямоугольника
        Возвращаемое значение:
            area (int/float): площадь прямоугольника
    '''  
    return a * b 

def perimeter(a, b): 
    '''
    Принимает стороны прямоугольника и возвращает периметр
        Параметры:
            a (int/float): первая сторона прямоугольника
            b (int/float): вторая сторона прямоугольника
        Возвращаемое значение:
            perimeter (int/float): периметр прямоугольника
    ''' 
    return 2*a + 2*b 
