
def area(a):
    '''
    Принимает сторону квадрата и возвращает площадь

        Параметры:
            a (int/float): сторона квадрата

        Возвращаемое значение:
            area (int/float): площадь квадрата
    ''' 
    return a * a


def perimeter(a):
    '''
    Принимает сторону квадрата и возвращает периметр

        Параметры:
            a (int/float): первая сторона квадрата
            
        Возвращаемое значение:
            perimeter (int/float): периметр квадрата
    ''' 
    return 4 * a
