def area(a, h):
    '''
    Принимает сторону и высоту треугольника и возвращает площадь
        Параметры:
            a (int/float): сторона треугольника
            h (int/float): высота треугольника
        Возвращаемое значение:
            area (int/float): площадь треугольника
    ''' 
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Принимает стороны треугольника и возвращает периметр
        Параметры:
            a (int/float): первая сторона треугольника
            b (int/float): вторая сторона треугольника
            c (int/float): третья сторона треугольника
        Возвращаемое значение:
            perimeter (int/flot): периметр треугольника
    ''' 
    return a + b + c 
